src/test/resources/resp-08.12.16_fault.xml

<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:exc14n="http://www.w3.org/2001/10/xml-exc-c14n#"><S:Header><To xmlns="http://www.w3.org/2005/08/addressing" wsu:Id="_5006">https://brokertest.cetelem-bank.ru/CreditBroker/LoanService</To><Action xmlns="http://www.w3.org/2005/08/addressing" xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" S:mustUnderstand="1" wsu:Id="_5005">http://webbroker.cetelem.ru/LoanService/createRequest</Action><ReplyTo xmlns="http://www.w3.org/2005/08/addressing" wsu:Id="_5004">
    <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
</ReplyTo><FaultTo xmlns="http://www.w3.org/2005/08/addressing" wsu:Id="_5002">
    <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
</FaultTo><MessageID xmlns="http://www.w3.org/2005/08/addressing" wsu:Id="_5003">uuid:4dfbd268-effa-49f5-8048-050cb9e1bc42</MessageID><wsse:Security S:mustUnderstand="1"><wsu:Timestamp xmlns:ns16="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512" xmlns:ns15="http://www.w3.org/2003/05/soap-envelope" wsu:Id="_3"><wsu:Created>2016-12-08T11:36:51Z</wsu:Created><wsu:Expires>2016-12-08T11:41:51Z</wsu:Expires></wsu:Timestamp><wsse:BinarySecurityToken xmlns:ns16="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512" xmlns:ns15="http://www.w3.org/2003/05/soap-envelope" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" wsu:Id="uuid_1b1bffcd-e1fe-4764-b4c4-800c721e614d" xmlns:xop="http://www.w3.org/2004/08/xop/include"><xop:Include href="cid:ecd72923-53b2-45a0-bca3-082477653920@example.jaxws.sun.com"/></wsse:BinarySecurityToken><ds:Signature xmlns:ns16="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512" xmlns:ns15="http://www.w3.org/2003/05/soap-envelope" Id="_1"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><exc14n:InclusiveNamespaces PrefixList="wsse S"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#_5002"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><exc14n:InclusiveNamespaces PrefixList="S"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>q3OhGHNaPipxPuCMjJC+PyT68TI=</ds:DigestValue></ds:Reference><ds:Reference URI="#_5003"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><exc14n:InclusiveNamespaces PrefixList="S"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>EbXw3Ro+A8ZcIZD79MZElp6JOHw=</ds:DigestValue></ds:Reference><ds:Reference URI="#_5004"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><exc14n:InclusiveNamespaces PrefixList="S"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>5Ab1ebo4/FraGgck/A8iDx1J9+I=</ds:DigestValue></ds:Reference><ds:Reference URI="#_5005"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><exc14n:InclusiveNamespaces PrefixList="S"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>2WNkPZGfLSM1TAh0fz8E45vnbEE=</ds:DigestValue></ds:Reference><ds:Reference URI="#_5006"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><exc14n:InclusiveNamespaces PrefixList="S"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>9NdkoXabDEvK2Dv8ambpMvc6Ges=</ds:DigestValue></ds:Reference><ds:Reference URI="#_5007"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><exc14n:InclusiveNamespaces PrefixList="S"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>fkmzeziSX60ImirPtTBMfHweSj4=</ds:DigestValue></ds:Reference><ds:Reference URI="#_3"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><exc14n:InclusiveNamespaces PrefixList="wsu wsse S"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>aANm4No+olCLu/Z+xQWMtG8UKIE=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>fUGjhv+CuaqvPWVsmbayRsErqb7uQv5LkCyJWdIKvlQbuHf/S9knqFV1gVf3kF2iLf35UpTynPB/
JPEC28LrcmHF+Rb5mg3Er/jQYvV9ue4ajOzjADGNoJnpntAS19wVQsv14Mf08bYhKN4oI4plAUeU
Zn1+/I9fZZQJIQs/F/U=</ds:SignatureValue><ds:KeyInfo><wsse:SecurityTokenReference><wsse:Reference URI="#uuid_1b1bffcd-e1fe-4764-b4c4-800c721e614d" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></S:Header><S:Body wsu:Id="_5007"><ns2:create xmlns:ns2="http://webbroker.cetelem.ru/"><input><authInfo><pointOfSale>200055</pointOfSale><user>WebBroker</user></authInfo><parameters><loanData><creditProductCode>0566</creditProductCode><downpaymentPercent>0.0</downpaymentPercent><downpaymentRUB>0</downpaymentRUB><durationInMonths>12</durationInMonths><good1><discountCode>Да</discountCode><goodCostRUB>4990</goodCostRUB><goodCode>104</goodCode><goodCostKOP>0</goodCostKOP><goodCostWithDiscountRUB>4391.0</goodCostWithDiscountRUB><goodDescription>Micromax Q415</goodDescription><segmentCode>HAB</segmentCode></good1><good2><discountCode>Нет</discountCode><goodCostRUB>474</goodCostRUB><goodCostKOP>0</goodCostKOP><goodCostWithDiscountRUB>474.0</goodCostWithDiscountRUB><goodDescription>РГС - Жизнь (09)</goodDescription></good2><lkpInsuranceOptionCode></lkpInsuranceOptionCode><maxMonthlyPaymentRUB>1000</maxMonthlyPaymentRUB><smsInformCode>1</smsInformCode></loanData><personalData><advertizingAgreementCode>Да</advertizingAgreementCode><bankAccountsData><accountCode>Нет</accountCode></bankAccountsData><car/><contactPerson>Никитина Елена Ивановна</contactPerson><creditCardAgreementCode>Нет</creditCardAgreementCode><creditCardInsuranceAgreementCode>Нет</creditCardInsuranceAgreementCode><dateOfBirthDDMMYYYY>30.11.1992</dateOfBirthDDMMYYYY><drivingLicense/><educationCode>6</educationCode><employment><durationOfWorkOnPreviousPlaceInYears>0</durationOfWorkOnPreviousPlaceInYears><holderPositionCode>47</holderPositionCode><organizationActivityCode>PR</organizationActivityCode><organizationActivitySector375PCode>0001</organizationActivitySector375PCode><organizationActivitySectorCode>5200</organizationActivitySectorCode><organizationAddress><regionCode>55</regionCode><index>644047</index><townName>Омск</townName><townType>C</townType><streetName>Гусарова</streetName><streetType>29</streetType><house>115</house><building></building><corpus></corpus><office></office></organizationAddress><organizationName>ООО "Парус"</organizationName><recordOfServiceInYears>3</recordOfServiceInYears><workFromMMYYYY>03.2014</workFromMMYYYY></employment><expenses><compulsoryMonthlyPaymentsInRUB>0</compulsoryMonthlyPaymentsInRUB><familyMonthlyLoansWithoutClientsPaymentsInRUB>0</familyMonthlyLoansWithoutClientsPaymentsInRUB><loansMonthlyPaymentsInRUB>0</loansMonthlyPaymentsInRUB><utilitiesMonthlyPaymentsInRUB>0</utilitiesMonthlyPaymentsInRUB></expenses><factAddress><regionCode>55</regionCode><index>644120</index><townName>Омск</townName><townType>C</townType><streetName>Станционная 1-я</streetName><streetType>29</streetType><house>108а</house><building></building><corpus></corpus><flat></flat><dateFromMMYYYY>11.1993</dateFromMMYYYY><housingStatus>P</housingStatus></factAddress><firstName>Петр</firstName><foreignPassport/><homePhone><code>8381</code><extension>-1</extension><number>2555555</number></homePhone><income><clientsAdditionalMonthlyIncomeInRUB>0</clientsAdditionalMonthlyIncomeInRUB><clientsEmploymentMonthlyIncomeInRUB>20000</clientsEmploymentMonthlyIncomeInRUB><familyMonthlyIncomeWithoutClientsIncomeInRUB>0</familyMonthlyIncomeWithoutClientsIncomeInRUB><totalFamilyMonthlyIncomeInRUB>20000</totalFamilyMonthlyIncomeInRUB></income><lastName>Петров</lastName><localPassport><dateOfIssueDDMMYYYY>18.12.2012</dateOfIssueDDMMYYYY><issuedBy>ОУФМС РОССИИ ПО ОМСКОЙ ОБЛ. В ОКТЯБРЬСКОМ АДМИНИСТРАТИВНОМ ОКРУГЕ Г. ОМСКА</issuedBy><number>969696</number><series>5212</series><subdivisionCode>550-003</subdivisionCode></localPassport><mailingAddressFlag>1</mailingAddressFlag><maritalStatusCode>C</maritalStatusCode><middleName>Петрович</middleName><mobilePhone><code>8908</code><extension>-1</extension><number>0589698</number></mobilePhone><mothersMaidenName>Иванова</mothersMaidenName><nameChangeCode>Нет</nameChangeCode><numberOfChildren>0</numberOfChildren><numberOfDependents>0</numberOfDependents><numberOfFamilyMembers>1</numberOfFamilyMembers><occupationCode>D</occupationCode><officialsCode>Нет</officialsCode><placeOfBirth>Г. ОМСКА</placeOfBirth><previousLastName>Петров</previousLastName><registrationAddress><regionCode>55</regionCode><index>644120</index><townName>Омск</townName><townType>C</townType><streetName>Станционная 1-я</streetName><streetType>29</streetType><house>108а</house><building></building><corpus></corpus><flat></flat><dateFromMMYYYY>11.1993</dateFromMMYYYY></registrationAddress><relativePhone><code>8908</code><extension>-1</extension><number>1005555</number></relativePhone><sexCode>MAL</sexCode><spouseWorkingPhone><code>8</code><extension>-1</extension></spouseWorkingPhone><workingPhone><code>8381</code><extension>-1</extension><number>2686868</number></workingPhone><addPhone1/><prevPassport/></personalData><visualAppraisalData><suspiciousPerson>0</suspiciousPerson><suspiciousPersonComment></suspiciousPersonComment><suspiciousBehavior>0</suspiciousBehavior><suspiciousBehaviorComment></suspiciousBehaviorComment><suspiciousLoan>0</suspiciousLoan><suspiciousLoanComment></suspiciousLoanComment><suspiciousPersonData>0</suspiciousPersonData><suspiciousPersonDataComment></suspiciousPersonDataComment><thirdPersonInfluence>0</thirdPersonInfluence><thirdPersonInfluenceComment></thirdPersonInfluenceComment><suspiciousPassport>0</suspiciousPassport><suspiciousPassportComment></suspiciousPassportComment><suspiciousAdditionalDocuments>0</suspiciousAdditionalDocuments><suspiciousAdditionalDocumentsComment></suspiciousAdditionalDocumentsComment><suspiciousFinanceDocument>0</suspiciousFinanceDocument><suspiciousFinanceDocumentComment></suspiciousFinanceDocumentComment></visualAppraisalData></parameters><attachments><photo/><scannedDocuments/></attachments></input></ns2:create></S:Body></S:Envelope>
